# PathName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..PathName Property
Document Class Example See Also
---
The fully qualified path of the document's disk file.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string PathName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PathName As String
	Get
```

Visual C++
---
```text
public:
property String^ PathName {
	String^ get ();
}
```

# Remarks
This string is empty if the project has not been saved or does not have a disk file associated with it yet. Note that the pathname will be empty if a document is detached. See IsDetached.
# Examples
CopyC#
```text
string docPathName = document.PathName;
```

CopyVB.NET
```text
Dim docPathName As String = document.PathName
```

# See Also
Document Class
Autodesk.Revit.DB Namespace